(carnd-term1) C:\Development\Udacity\carnd\P2-DL\P3-Behavioral_Cloning_Project>python model.py
Using TensorFlow backend.
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to
====================================================================================================
lambda_1 (Lambda)                (None, 80, 160, 3)    0           lambda_input_1[0][0]
____________________________________________________________________________________________________
convolution2d_1 (Convolution2D)  (None, 78, 158, 16)   448         lambda_1[0][0]
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 78, 158, 16)   0           convolution2d_1[0][0]
____________________________________________________________________________________________________
maxpooling2d_1 (MaxPooling2D)    (None, 39, 79, 16)    0           activation_1[0][0]
____________________________________________________________________________________________________
convolution2d_2 (Convolution2D)  (None, 37, 77, 32)    4640        maxpooling2d_1[0][0]
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 37, 77, 32)    0           convolution2d_2[0][0]
____________________________________________________________________________________________________
maxpooling2d_2 (MaxPooling2D)    (None, 12, 25, 32)    0           activation_2[0][0]
____________________________________________________________________________________________________
convolution2d_3 (Convolution2D)  (None, 10, 23, 48)    13872       maxpooling2d_2[0][0]
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 10, 23, 48)    0           convolution2d_3[0][0]
____________________________________________________________________________________________________
maxpooling2d_3 (MaxPooling2D)    (None, 5, 11, 48)     0           activation_3[0][0]
____________________________________________________________________________________________________
flatten_1 (Flatten)              (None, 2640)          0           maxpooling2d_3[0][0]
____________________________________________________________________________________________________
dropout_1 (Dropout)              (None, 2640)          0           flatten_1[0][0]
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 256)           676096      dropout_1[0][0]
____________________________________________________________________________________________________
activation_4 (Activation)        (None, 256)           0           dense_1[0][0]
____________________________________________________________________________________________________
dropout_2 (Dropout)              (None, 256)           0           activation_4[0][0]
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 128)           32896       dropout_2[0][0]
____________________________________________________________________________________________________
activation_5 (Activation)        (None, 128)           0           dense_2[0][0]
____________________________________________________________________________________________________
dense_3 (Dense)                  (None, 16)            2064        activation_5[0][0]
____________________________________________________________________________________________________
activation_6 (Activation)        (None, 16)            0           dense_3[0][0]
____________________________________________________________________________________________________
dense_4 (Dense)                  (None, 1)             17          activation_6[0][0]
====================================================================================================
Total params: 730,033
Trainable params: 730,033
Non-trainable params: 0
____________________________________________________________________________________________________
Epoch 1/10
20224/20224 [==============================] - 218s - loss: 0.1147 - mean_squared_error: 0.1147 - val_loss: 0.0180 - val_mean_squared_error: 0.0180
Epoch 2/10
20224/20224 [==============================] - 210s - loss: 0.0383 - mean_squared_error: 0.0383 - val_loss: 0.0151 - val_mean_squared_error: 0.0151
Epoch 3/10
20224/20224 [==============================] - 200s - loss: 0.0321 - mean_squared_error: 0.0321 - val_loss: 0.0175 - val_mean_squared_error: 0.0175
Epoch 4/10
20224/20224 [==============================] - 201s - loss: 0.0285 - mean_squared_error: 0.0285 - val_loss: 0.0184 - val_mean_squared_error: 0.0184
Epoch 5/10
20224/20224 [==============================] - 199s - loss: 0.0281 - mean_squared_error: 0.0281 - val_loss: 0.0174 - val_mean_squared_error: 0.0174
Epoch 6/10
20224/20224 [==============================] - 212s - loss: 0.0276 - mean_squared_error: 0.0276 - val_loss: 0.0162 - val_mean_squared_error: 0.0162
Epoch 7/10
20224/20224 [==============================] - 217s - loss: 0.0264 - mean_squared_error: 0.0264 - val_loss: 0.0167 - val_mean_squared_error: 0.0167
Epoch 8/10
20224/20224 [==============================] - 215s - loss: 0.0254 - mean_squared_error: 0.0254 - val_loss: 0.0158 - val_mean_squared_error: 0.0158
Epoch 9/10
20224/20224 [==============================] - 216s - loss: 0.0249 - mean_squared_error: 0.0249 - val_loss: 0.0179 - val_mean_squared_error: 0.0179
Epoch 10/10
20224/20224 [==============================] - 216s - loss: 0.0246 - mean_squared_error: 0.0246 - val_loss: 0.0177 - val_mean_squared_error: 0.0177
Model saving...
Done