{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0018\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "trainable": true, "arguments": {}, "input_dtype": "float32", "output_shape": null, "batch_input_shape": [null, 80, 160, 3], "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "dim_ordering": "tf", "b_regularizer": null, "bias": true, "trainable": true, "activation": "linear", "W_regularizer": null, "border_mode": "valid", "b_constraint": null, "name": "convolution2d_1", "W_constraint": null, "nb_col": 3, "nb_filter": 16, "init": "glorot_uniform", "nb_row": 3, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "dim_ordering": "tf", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "dim_ordering": "tf", "b_regularizer": null, "bias": true, "trainable": true, "activation": "linear", "W_regularizer": null, "border_mode": "valid", "b_constraint": null, "name": "convolution2d_2", "W_constraint": null, "nb_col": 3, "nb_filter": 32, "init": "glorot_uniform", "nb_row": 3, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "dim_ordering": "tf", "strides": [3, 3], "trainable": true, "pool_size": [3, 3], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "dim_ordering": "tf", "b_regularizer": null, "bias": true, "trainable": true, "activation": "linear", "W_regularizer": null, "border_mode": "valid", "b_constraint": null, "name": "convolution2d_3", "W_constraint": null, "nb_col": 3, "nb_filter": 48, "init": "glorot_uniform", "nb_row": 3, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "dim_ordering": "tf", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "trainable": true, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "name": "dense_1", "W_constraint": null, "input_dim": 2640, "output_dim": 256, "b_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_4"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "trainable": true, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "name": "dense_2", "W_constraint": null, "input_dim": 256, "output_dim": 128, "b_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_5"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "trainable": true, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "name": "dense_3", "W_constraint": null, "input_dim": 128, "output_dim": 16, "b_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_6"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "trainable": true, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "name": "dense_4", "W_constraint": null, "input_dim": 16, "output_dim": 1, "b_constraint": null, "activity_regularizer": null}}]}